{
  "success": true,
  "video_id": "GlnzQog0J24",
  "segments": 110,
  "transcript": [
    {
      "start": 0,
      "text": "I don't know what to say.  I don't know what to say."
    },
    {
      "start": 23,
      "text": "Good morning all my beautiful people.  I hope you're doing well. I slept like a little"
    },
    {
      "start": 29,
      "text": "baby after that ride earlier. I got to push it for  5 days now and then I will end up in Kathmandu. 12"
    },
    {
      "start": 38,
      "text": "hours ride per day. Push push push because I need  to be there in 5 days. So let adventure continue."
    },
    {
      "start": 48,
      "text": "The Asamese people are waking up, starting their  shops, collecting some garbage from the street,"
    },
    {
      "start": 56,
      "text": "feeding the cows. Starting the  morning. Yes. Beautiful morning."
    },
    {
      "start": 72,
      "text": "Chaos."
    },
    {
      "start": 80,
      "text": "And there we go. Almost. No.  One more reverse. So, stop stop."
    },
    {
      "start": 96,
      "text": "And there. Off we go."
    },
    {
      "start": 102,
      "text": "I have no idea what is going on  here. There are thousand of trucks"
    },
    {
      "start": 109,
      "text": "is waiting on this side and now we have  200 trucks coming this side. It's crazy."
    },
    {
      "start": 120,
      "text": "Wow."
    },
    {
      "start": 123,
      "text": "Oh, I don't like this. I don't like this. I  don't like this. This bridge is not made for"
    },
    {
      "start": 128,
      "text": "this. Get off. Get off. Whoa. It's  too heavy on the track. Oh,"
    },
    {
      "start": 148,
      "text": "why are there so many tracks  lined up like this? Oh my god,"
    },
    {
      "start": 153,
      "text": "this is terrible choice. Terrible choice  of road. Think positive. Think positive."
    },
    {
      "start": 159,
      "text": "Think positive. [Laughter] Ah,  I do what I can but. But"
    },
    {
      "start": 170,
      "text": "this has to stop. I have such  a bad time right now."
    },
    {
      "start": 187,
      "text": "And this is moment where you need the momentum  to ride stuck like that car. It won't work. God,"
    },
    {
      "start": 196,
      "text": "I sound so negative right now,  but I'm not having a good time."
    },
    {
      "start": 203,
      "text": "Can you recognize yourself in this moment when  you want to resign and just stop everything and ah"
    },
    {
      "start": 220,
      "text": "reality the reality I feel like uh  I want to quit too much for my body right now."
    },
    {
      "start": 238,
      "text": "It's too much. Well, that is the  reality how I feel at the moment."
    },
    {
      "start": 252,
      "text": "This is like a Tetris sort of a Tetris game.  Oh, try to fit and move around the tracks in"
    },
    {
      "start": 264,
      "text": "the right way, cars in the right way, so  everyone can fit on the road. Tetris. This"
    },
    {
      "start": 271,
      "text": "is Tetris. The surroundings is really beautiful  with a nature reserve. I think it is energy level"
    },
    {
      "start": 280,
      "text": "minus one. I don't sound too enthusiastic.  I know. I try to do my best here to survive."
    },
    {
      "start": 292,
      "text": "Dusty, hot, a lot of honking, a  lot of pollution from the tracks."
    },
    {
      "start": 304,
      "text": "Yeah."
    },
    {
      "start": 308,
      "text": "Oof. Every track you pass, you get a  lot of smoke and pollution from. But"
    },
    {
      "start": 315,
      "text": "we got to keep on pushing. We got to keep  on going. We got it. We got it. These are"
    },
    {
      "start": 324,
      "text": "the moments in your life. You're challenged  for some way. Universe is challenging you,"
    },
    {
      "start": 332,
      "text": "trying to teach you something.  Maybe for me some more patience."
    },
    {
      "start": 339,
      "text": "Yeah, that could be some more patience. Right."
    },
    {
      "start": 347,
      "text": "We can do it. We can do it. I just  got to drink tons of water. So now"
    },
    {
      "start": 354,
      "text": "we have to fix the puzzles. Someone  needs to move. There they go. Good."
    },
    {
      "start": 361,
      "text": "Good. Good. Good. And then these trucks can go.  And we can go a little bit. Couple of meters."
    },
    {
      "start": 373,
      "text": "No. But look, it's no trucks parked. They're gone.  Yay. All right. I said it too early, I think."
    },
    {
      "start": 388,
      "text": "But at least there are no parked trucks, so that  is just awome. You see the surroundings is really,"
    },
    {
      "start": 397,
      "text": "really gorgeous. So much greenery, hills,  mountains. It's very nice. Finally,"
    },
    {
      "start": 405,
      "text": "I can enjoy it. In the heat of the moment  there, I was like almost panicking, you know,"
    },
    {
      "start": 412,
      "text": "because we were stuck between the trucks, so  much pollution, couldn't breathe. I tried to"
    },
    {
      "start": 419,
      "text": "put on my my buff, my scarf or my mouth, but it  didn't help. It was still just coming through."
    },
    {
      "start": 429,
      "text": "And now we are back to freedom."
    },
    {
      "start": 435,
      "text": "Oh wow."
    },
    {
      "start": 439,
      "text": "We have a tunnel here. Ah, that was very short."
    },
    {
      "start": 446,
      "text": "Ride, eat, sleep, repeat. That was my rhythm  now. Chasing the road, chasing time. Kathmandu"
    },
    {
      "start": 453,
      "text": "was calling and I was closing in. I was running  on fumes, sunburned, dusty, and strangely at"
    },
    {
      "start": 459,
      "text": "peace. Stopping now and then for something good to  eat, savoring the last moments in India. Then came"
    },
    {
      "start": 466,
      "text": "my second to last day. The heat was thick, the  air was dry. I pulled over for a sip of water."
    },
    {
      "start": 471,
      "text": "Just a quick pause. And then I saw it, a truck  reversing, slow, blind, heading straight for my"
    },
    {
      "start": 479,
      "text": "bike. I screamed. I waved. Nothing. And then that  sound. metal plastic gun saw my companion through"
    },
    {
      "start": 488,
      "text": "thousands of kilometers crushed in seconds. I  stood there still empty, heartbroken in shock."
    },
    {
      "start": 503,
      "text": "I don't know what to say.  Don't know what to say."
    },
    {
      "start": 533,
      "text": "Yep."
    },
    {
      "start": 548,
      "text": "I just need to get myself togheter. I'm so shocked."
    },
    {
      "start": 567,
      "text": "This one this one so bad."
    },
    {
      "start": 575,
      "text": "Wind screen is off. Well, partly of  this is lost some glass and stuff here."
    },
    {
      "start": 588,
      "text": "And then of course the traffic ones. I'm  not sure if this going to touch my tire."
    },
    {
      "start": 592,
      "text": "Looks okay, but I don't know."
    },
    {
      "start": 605,
      "text": "Oh my why why"
    },
    {
      "start": 612,
      "text": "baby?"
    },
    {
      "start": 616,
      "text": "Holy smoke. We're going to try the  bike now. I'm not even sure this is"
    },
    {
      "start": 621,
      "text": "going to work. No, I don't know. We got to try it."
    },
    {
      "start": 636,
      "text": "I can see that the light the light  is not working properly indicating."
    },
    {
      "start": 645,
      "text": "Yeah, that's what it is. Luckily, I  wasn't hurt. That was the most important."
    },
    {
      "start": 651,
      "text": "I rode slowly to the closest mechanic. Still  in shock, unsure how bad the damage really was,"
    },
    {
      "start": 656,
      "text": "I expected the worst. But instead, I found help.  At a Honda, they welcome me without hesitation."
    },
    {
      "start": 663,
      "text": "No questions, no judgment, just support.  It was one of the best service experiences"
    },
    {
      "start": 668,
      "text": "I ever had. Quick, kind, and far beyond  what I expected. I will never forget it."
    },
    {
      "start": 675,
      "text": "Here she comes, they've been helping me to fix my my side stand because it was so so so weird. Was"
    },
    {
      "start": 683,
      "text": "pointing to another direction. So, finally.  So, I'm at the Honda in a town. I don't even"
    },
    {
      "start": 690,
      "text": "know. Perfect. Sweet. So, I can go out and  try it on. But hey, what a day. So kind of"
    },
    {
      "start": 698,
      "text": "on there. My god. I will write the city right  here. People are so kind here. Honda Honda"
    },
    {
      "start": 708,
      "text": "so kind. I'm going to take the chain and fix a  little bit of the the plastic the windscreen is"
    },
    {
      "start": 712,
      "text": "no point to doing anything. I do that back home  in Sweden. Maybe a temporary fix in Kathmandu. We"
    },
    {
      "start": 717,
      "text": "will see. We see what I manage. But for now, I'm  just so happy that I'm not hurt. I'm fine. It's"
    },
    {
      "start": 724,
      "text": "just plastic basically on the motorcycle  and few parts which I can fix back home."
    },
    {
      "start": 731,
      "text": "I have chain spray if we need. Don't Don't worry.  Don't worry.  So, we see here it's just to"
    },
    {
      "start": 741,
      "text": "remove this one. This is completely waste. Maybe  I can put it on temporary. We will see. But,"
    },
    {
      "start": 748,
      "text": "uh this one, you see it's broken. Broken.  Everything works. Indicator works. All the"
    },
    {
      "start": 755,
      "text": "all the system here works. It's just  plastic, you know. And this one, well,"
    },
    {
      "start": 762,
      "text": "it get bent up a little bit. So, we're going to  take it down away from that. Yeah, the side step"
    },
    {
      "start": 768,
      "text": "is fixed. The light this one that I will do  in Kathmandu few scratches. Yeah, could be worse."
    },
    {
      "start": 782,
      "text": "You see fixing it, taking it down a little bit  because it's way too high the clutch. I have"
    },
    {
      "start": 787,
      "text": "to reach it like stretch my hands to reach it.  We're going to fix it. So much kindness here."
    },
    {
      "start": 794,
      "text": "This motorcycle is a warrior. My god, she's  been through so much. I feel like this is the"
    },
    {
      "start": 801,
      "text": "the end of the trip. I am so finished. And  she's finished. We are both finished. I mean,"
    },
    {
      "start": 808,
      "text": "we had a great time, but we can feel that it's  the end. And look what I doing now. Are fixing"
    },
    {
      "start": 816,
      "text": "my windscreen temporary. Wow, it's great. So,  I have something because the wind is really,"
    },
    {
      "start": 822,
      "text": "really, really hard actually without the  windscreen. I realized now after the highway,"
    },
    {
      "start": 827,
      "text": "it's so just a temporary fix until I come back  home to Sweden, then I can order a new one."
    },
    {
      "start": 834,
      "text": "These guys help me so much."
    },
    {
      "start": 838,
      "text": "Oh, Indian hospitality here. Come on. Everything  was just a mess. And now everything turns to such"
    },
    {
      "start": 847,
      "text": "a good day. Look. Ow. Royal treatment. And she  got some polish on her.  We've"
    },
    {
      "start": 860,
      "text": "been through a lot. E. How? How? Oh, I was so  shocked before I I don't know how I even recorded"
    },
    {
      "start": 870,
      "text": "the thing. Like afterwards, I was shaking and  like, \"Oh, no.\" I thought everything was broken."
    },
    {
      "start": 879,
      "text": "Looks perfect. Look at that."
    },
    {
      "start": 886,
      "text": "Polished."
    },
    {
      "start": 890,
      "text": "Thank you. Thank you. Thank you. Okay. So"
    },
    {
      "start": 905,
      "text": "yeah, voila. Have a try this  time. Perfect. Perfect."
    },
    {
      "start": 918,
      "text": "Okay. Thank you so much, man.  Yeah, appreciate it. So kind."
    },
    {
      "start": 924,
      "text": "Bye-bye."
    },
    {
      "start": 934,
      "text": "Shoop."
    },
    {
      "start": 940,
      "text": "Okay. And off we go Sarek"
    },
    {
      "start": 948,
      "text": "What a day."
    },
    {
      "start": 951,
      "text": "Holy smoke. Holy smoky. Oh, this temporary fix is  just awesome. I mean, I got to throw it anyway."
    },
    {
      "start": 960,
      "text": "Used to have something for the wind. And I didn't  have to pay a single penny for this. Come on."
    },
    {
      "start": 970,
      "text": "Hospitality. You're my guest,  he said. Oh, so so so kind."
    },
    {
      "start": 981,
      "text": "A big hug to Honda motorcycles  here in this town. Thank you."
    }
  ]
}