{
  "success": true,
  "video_id": "rBpaUICxEhk",
  "segments": 59,
  "transcript": [
    {
      "start": 11,
      "text": "Existence - the physical universe, is basically playful."
    },
    {
      "start": 16,
      "text": "There is no necessity for it whatsoever."
    },
    {
      "start": 20,
      "text": "It isn't going anywhere,"
    },
    {
      "start": 22,
      "text": "that is to say, it doesn't"
    },
    {
      "start": 26,
      "text": "have some destination that it ought to arrive at."
    },
    {
      "start": 30,
      "text": "But, it is best understood by analogy with music."
    },
    {
      "start": 37,
      "text": "Because music, as an art form,"
    },
    {
      "start": 40,
      "text": "is essentially playful. We say you play the piano."
    },
    {
      "start": 44,
      "text": "You don't work the piano."
    },
    {
      "start": 48,
      "text": "Why?"
    },
    {
      "start": 50,
      "text": "Music differs from, say, travel."
    },
    {
      "start": 52,
      "text": "When you travel, you are trying to get somewhere."
    },
    {
      "start": 57,
      "text": "One doesn't make the end of the composition"
    },
    {
      "start": 63,
      "text": "the point of the composition."
    },
    {
      "start": 65,
      "text": "If that were so, the best conductors would be those who played fastest."
    },
    {
      "start": 69,
      "text": "(laughter in audience)"
    },
    {
      "start": 72,
      "text": "And there would be composers who wrote only finales."
    },
    {
      "start": 77,
      "text": "People would go to concerts just to hear one cracking chord, 'cause that's the end."
    },
    {
      "start": 82,
      "text": "(laughing)"
    },
    {
      "start": 84,
      "text": "Same when dancing -"
    },
    {
      "start": 85,
      "text": "you don't aim at a particular spot in the room,"
    },
    {
      "start": 87,
      "text": "that's where you should arrive."
    },
    {
      "start": 89,
      "text": "The whole point of the dancing is the dance!"
    },
    {
      "start": 94,
      "text": "Now, but we don't see that as"
    },
    {
      "start": 97,
      "text": "something brought by our education into our everyday conduct."
    },
    {
      "start": 104,
      "text": "We've got a system"
    },
    {
      "start": 105,
      "text": "of schooling, which gives a completely different impression."
    },
    {
      "start": 110,
      "text": "It's all graded."
    },
    {
      "start": 112,
      "text": "And what we do is we put the child into the corridor,"
    },
    {
      "start": 116,
      "text": "of this grade system,"
    },
    {
      "start": 118,
      "text": "with a kind of \"Come on, kitty kitty kitty\""
    },
    {
      "start": 120,
      "text": "and now, you go to kindergarten, you know,"
    },
    {
      "start": 122,
      "text": "and that's a great thing because"
    },
    {
      "start": 123,
      "text": "when you finish that you get into first grade."
    },
    {
      "start": 126,
      "text": "And then, come on, first grade leads to second grade and so on"
    },
    {
      "start": 130,
      "text": "and then you get out of grade school and you go to high school,"
    },
    {
      "start": 132,
      "text": "and it's revving up - the thing is coming!"
    },
    {
      "start": 134,
      "text": "And then you're gonna go to college"
    },
    {
      "start": 135,
      "text": "and, by Jove, then you'll get into graduate school,"
    },
    {
      "start": 138,
      "text": "and when you're through with graduate school you'll go out to join the world."
    },
    {
      "start": 141,
      "text": "And then you'll get into some racket, where you're selling insurance."
    },
    {
      "start": 145,
      "text": "And they've got that quota to make."
    },
    {
      "start": 148,
      "text": "And you're gonna make that. And all the time that thing is coming,"
    },
    {
      "start": 151,
      "text": "it's coming, it's coming, that great thing - the success you're working for."
    },
    {
      "start": 155,
      "text": "Then, when you wake up one day about forty years old,"
    },
    {
      "start": 158,
      "text": "you say, \"My God, I've arrived. I'm there!\""
    },
    {
      "start": 161,
      "text": "And you don't feel very different from what you always felt."
    },
    {
      "start": 166,
      "text": "By expectation, look at the people who live to retire"
    },
    {
      "start": 170,
      "text": "and put those savings away."
    },
    {
      "start": 172,
      "text": "And then, when they're 65, they don't have any energy left, they're more or less impotent and uh,"
    },
    {
      "start": 179,
      "text": "they go and rot in an old people's \"senior citizen's community\"."
    },
    {
      "start": 186,
      "text": "Ha ha"
    },
    {
      "start": 186,
      "text": "Because we simply cheated ourselves the whole way down the line."
    },
    {
      "start": 194,
      "text": "We thought of life by analogy with a journey"
    },
    {
      "start": 197,
      "text": "with a pilgrimage, which had a serious purpose at the end, and the thing was to get to that end."
    },
    {
      "start": 202,
      "text": "Success, or whatever it is, or maybe Heaven after you're dead."
    },
    {
      "start": 207,
      "text": "But, we missed the point the whole way along."
    },
    {
      "start": 210,
      "text": "It was a musical thing, and you were supposed to sing, or to dance, while the music was being played."
    },
    {
      "start": 232,
      "text": "For more interesting videos like this one, please subscribe."
    }
  ]
}