{
  "success": true,
  "video_id": "UF8uR6Z6KLc",
  "segments": 244,
  "transcript": [
    {
      "start": 7,
      "text": "This program is brought to you by Stanford University."
    },
    {
      "start": 10,
      "text": "Please visit us at stanford.edu"
    },
    {
      "start": 22,
      "text": "Thank You. I am honored to be with you today at your commencement"
    },
    {
      "start": 30,
      "text": "from one of the finest universities in the world."
    },
    {
      "start": 35,
      "text": "Truth be told I never graduated from college"
    },
    {
      "start": 41,
      "text": "and this is the closest I've ever gotten to a college graduation."
    },
    {
      "start": 47,
      "text": "Today I want to tell you three stories from my life. That's it."
    },
    {
      "start": 52,
      "text": "No big deal. Just three stories."
    },
    {
      "start": 55,
      "text": "The first story is about connecting the dots."
    },
    {
      "start": 61,
      "text": "I dropped out of Reed College after the first 6 months,"
    },
    {
      "start": 63,
      "text": "but then stayed around as a drop-in"
    },
    {
      "start": 65,
      "text": "for another 18 months or so before I really quit."
    },
    {
      "start": 69,
      "text": "So why did I drop out?"
    },
    {
      "start": 72,
      "text": "It started before I was born."
    },
    {
      "start": 75,
      "text": "My biological mother was a young, unwed graduate student,"
    },
    {
      "start": 79,
      "text": "and she decided to put me up for adoption."
    },
    {
      "start": 82,
      "text": "She felt very strongly that I should be adopted by college graduates,"
    },
    {
      "start": 86,
      "text": "so everything was all set for me to"
    },
    {
      "start": 88,
      "text": "be adopted at birth by a lawyer and his wife."
    },
    {
      "start": 91,
      "text": "Except that when I popped out they decided"
    },
    {
      "start": 94,
      "text": "at the last minute that they really wanted a girl."
    },
    {
      "start": 97,
      "text": "So my parents, who were on a waiting list,"
    },
    {
      "start": 100,
      "text": "got a call in the middle of the night asking: \"We have an unexpected"
    },
    {
      "start": 104,
      "text": "baby boy; do you want him?\""
    },
    {
      "start": 107,
      "text": "They said: \"Of course.\" My biological mother later found out that"
    },
    {
      "start": 113,
      "text": "my mother had never graduated from college"
    },
    {
      "start": 115,
      "text": "and that my father had never graduated from high school."
    },
    {
      "start": 119,
      "text": "She refused to sign the final adoption papers."
    },
    {
      "start": 123,
      "text": "She only relented a few months later when"
    },
    {
      "start": 125,
      "text": "my parents promised that I would go to college. This was the start in my life."
    },
    {
      "start": 132,
      "text": "And 17 years later I did go to college. But I naively chose a college"
    },
    {
      "start": 139,
      "text": "that was almost as expensive as Stanford,"
    },
    {
      "start": 142,
      "text": "and all of my working-class parents'"
    },
    {
      "start": 144,
      "text": "savings were being spent on my college tuition."
    },
    {
      "start": 147,
      "text": "After six months, I couldn't see the value in it."
    },
    {
      "start": 150,
      "text": "I had no idea what I wanted to do with my life"
    },
    {
      "start": 152,
      "text": "and no idea how college was going to help me figure it out."
    },
    {
      "start": 156,
      "text": "And here I was spending all of the money my parents had saved"
    },
    {
      "start": 160,
      "text": "their entire life."
    },
    {
      "start": 162,
      "text": "So I decided to drop out and trust that it would all work out OK."
    },
    {
      "start": 166,
      "text": "It was pretty scary at the time,"
    },
    {
      "start": 169,
      "text": "but looking back it was one of the best decisions I ever made."
    },
    {
      "start": 174,
      "text": "The minute I dropped out I could stop"
    },
    {
      "start": 176,
      "text": "taking the required classes that didn't interest me,"
    },
    {
      "start": 179,
      "text": "and begin dropping in on the ones that looked interesting."
    },
    {
      "start": 184,
      "text": "It wasn't all romantic. I didn't have a dorm room,"
    },
    {
      "start": 188,
      "text": "so I slept on the floor in friends' rooms,"
    },
    {
      "start": 190,
      "text": "I returned coke bottles for the 5 cent deposits to buy food with,"
    },
    {
      "start": 194,
      "text": "and I would walk the 7 miles across town every Sunday"
    },
    {
      "start": 197,
      "text": "night to get one good meal a week at the Hare Krishna"
    },
    {
      "start": 201,
      "text": "temple. I loved it."
    },
    {
      "start": 203,
      "text": "And much of what I stumbled into by following"
    },
    {
      "start": 206,
      "text": "my curiosity and intuition turned out to be priceless later on."
    },
    {
      "start": 209,
      "text": "Let me give you one example: Reed College at that"
    },
    {
      "start": 214,
      "text": "time offered perhaps the best calligraphy instruction in the country."
    },
    {
      "start": 218,
      "text": "Throughout the campus every poster, every label on every drawer,"
    },
    {
      "start": 222,
      "text": "was beautifully hand calligraphed."
    },
    {
      "start": 225,
      "text": "Because I had dropped out and didn't have to take the normal classes,"
    },
    {
      "start": 229,
      "text": "I decided to take a calligraphy class to learn how to do this."
    },
    {
      "start": 233,
      "text": "I learned about serif and san serif typefaces,"
    },
    {
      "start": 236,
      "text": "about varying the amount of space"
    },
    {
      "start": 237,
      "text": "between different letter combinations,"
    },
    {
      "start": 239,
      "text": "about what makes great typography great."
    },
    {
      "start": 243,
      "text": "It was beautiful, historical,"
    },
    {
      "start": 245,
      "text": "artistically subtle in a way that science can't capture,"
    },
    {
      "start": 249,
      "text": "and I found it fascinating."
    },
    {
      "start": 252,
      "text": "None of this had even a hope of any practical application in my life."
    },
    {
      "start": 257,
      "text": "But ten years later,"
    },
    {
      "start": 258,
      "text": "when we were designing the first Macintosh computer,"
    },
    {
      "start": 261,
      "text": "it all came back to me. And we designed it all into the Mac."
    },
    {
      "start": 265,
      "text": "It was the first computer with beautiful typography."
    },
    {
      "start": 269,
      "text": "If I had never dropped in on that single course in college,"
    },
    {
      "start": 272,
      "text": "the Mac would have never had multiple"
    },
    {
      "start": 274,
      "text": "typefaces or proportionally spaced fonts."
    },
    {
      "start": 277,
      "text": "And since Windows just copied the Mac,"
    },
    {
      "start": 279,
      "text": "it's likely that no personal computer would have them."
    },
    {
      "start": 287,
      "text": "If I had never dropped out,"
    },
    {
      "start": 291,
      "text": "I would have never dropped in on this calligraphy class,"
    },
    {
      "start": 294,
      "text": "and personal computers might not have the wonderful typography"
    },
    {
      "start": 297,
      "text": "that they do. Of course it was impossible to connect"
    },
    {
      "start": 300,
      "text": "the dots looking forward when I was in college."
    },
    {
      "start": 302,
      "text": "But it was very, very clear looking backwards ten years later."
    },
    {
      "start": 307,
      "text": "Again, you can't connect the dots looking forward;"
    },
    {
      "start": 310,
      "text": "you can only connect them looking backwards."
    },
    {
      "start": 312,
      "text": "So you have to trust that the dots will somehow connect"
    },
    {
      "start": 315,
      "text": "in your future."
    },
    {
      "start": 316,
      "text": "You have to trust in something, your gut, destiny, life, karma,"
    },
    {
      "start": 320,
      "text": "whatever."
    },
    {
      "start": 322,
      "text": "Beleiveing that the dots will connect down the road will give you the confidence to follow your heart"
    },
    {
      "start": 328,
      "text": "Even when it leads you off the well worn path, and that will make all the difference."
    },
    {
      "start": 338,
      "text": "My second story is about love and loss."
    },
    {
      "start": 344,
      "text": "I was lucky I found what I loved to do early in life."
    },
    {
      "start": 348,
      "text": "Woz and I started Apple in my parents garage when I was 20."
    },
    {
      "start": 351,
      "text": "We worked hard, and in 10 years Apple had grown from just the two of"
    },
    {
      "start": 355,
      "text": "us in a garage into a $2 billion company with over 4000 employees."
    },
    {
      "start": 359,
      "text": "We had just released our finest creation the Macintosh"
    },
    {
      "start": 363,
      "text": "a year earlier, and I had just turned 30."
    },
    {
      "start": 366,
      "text": "And then I got fired."
    },
    {
      "start": 369,
      "text": "How can you get fired from a company you started?"
    },
    {
      "start": 372,
      "text": "Well, as Apple grew we hired someone who I thought"
    },
    {
      "start": 375,
      "text": "was very talented to run the company with me,"
    },
    {
      "start": 378,
      "text": "and for the first year or so things went well."
    },
    {
      "start": 380,
      "text": "But then our visions of the future began"
    },
    {
      "start": 382,
      "text": "to diverge and eventually we had a falling out."
    },
    {
      "start": 385,
      "text": "When we did, our Board of Directors sided with him."
    },
    {
      "start": 389,
      "text": "So at 30 I was out. And very publicly out."
    },
    {
      "start": 392,
      "text": "What had been the focus of my entire adult life was gone,"
    },
    {
      "start": 395,
      "text": "and it was devastating."
    },
    {
      "start": 398,
      "text": "I really didn't know what to do for a few months."
    },
    {
      "start": 401,
      "text": "I felt that I had let the previous generation of entrepreneurs"
    },
    {
      "start": 403,
      "text": "down - that I had dropped the baton as it was being passed to me."
    },
    {
      "start": 407,
      "text": "I met with David Packard and Bob Noyce"
    },
    {
      "start": 410,
      "text": "and tried to apologize for screwing up so badly."
    },
    {
      "start": 414,
      "text": "I was a very public failure,"
    },
    {
      "start": 415,
      "text": "and I even thought about running away from the valley."
    },
    {
      "start": 418,
      "text": "But something slowly began to dawn on me I still loved what I did."
    },
    {
      "start": 423,
      "text": "The turn of events at Apple had not changed that one bit."
    },
    {
      "start": 427,
      "text": "I had been rejected, but I was still in love."
    },
    {
      "start": 432,
      "text": "And so I decided to start over."
    },
    {
      "start": 434,
      "text": "I didn't see it then, but it turned out that getting fired from"
    },
    {
      "start": 437,
      "text": "Apple was the best thing that could have ever happened to me."
    },
    {
      "start": 441,
      "text": "The heaviness of being successful was"
    },
    {
      "start": 443,
      "text": "replaced by the lightness of being a beginner again,"
    },
    {
      "start": 446,
      "text": "less sure about everything."
    },
    {
      "start": 447,
      "text": "It freed me to enter one of the most creative periods of my life."
    },
    {
      "start": 451,
      "text": "During the next five years, I started a company named NeXT,"
    },
    {
      "start": 454,
      "text": "another company named Pixar,"
    },
    {
      "start": 455,
      "text": "and fell in love with an amazing woman who would become my wife."
    },
    {
      "start": 459,
      "text": "Pixar went on to create the worlds first computer animated feature"
    },
    {
      "start": 462,
      "text": "film, Toy Story,"
    },
    {
      "start": 464,
      "text": "and is now the most successful animation studio in the world."
    },
    {
      "start": 469,
      "text": "In a remarkable turn of events, Apple bought NeXT,"
    },
    {
      "start": 473,
      "text": "I returned to Apple, and the technology we developed at"
    },
    {
      "start": 476,
      "text": "NeXT is at the heart of Apple's current renaissance."
    },
    {
      "start": 479,
      "text": "And Laurene and I have a wonderful family together."
    },
    {
      "start": 483,
      "text": "I'm pretty sure none of this would"
    },
    {
      "start": 485,
      "text": "have happened if I hadn't been fired from Apple."
    },
    {
      "start": 488,
      "text": "It was awful tasting medicine, but I guess the patient needed it."
    },
    {
      "start": 492,
      "text": "Sometimes life hits you in the head with a brick. Don't lose faith."
    },
    {
      "start": 498,
      "text": "I'm convinced that the only thing that kept me going was that I loved"
    },
    {
      "start": 501,
      "text": "what I did. You've got to find what you love."
    },
    {
      "start": 504,
      "text": "And that is as true for your work as it is for your lovers."
    },
    {
      "start": 508,
      "text": "Your work is going to fill a large part of your life,"
    },
    {
      "start": 510,
      "text": "and the only way to be truly satisfied"
    },
    {
      "start": 512,
      "text": "is to do what you believe is great work."
    },
    {
      "start": 515,
      "text": "And the only way to do great work is to love what you do."
    },
    {
      "start": 518,
      "text": "If you haven't found it yet, keep looking. Don't settle."
    },
    {
      "start": 523,
      "text": "As with all matters of the heart, you'll know when you find it."
    },
    {
      "start": 527,
      "text": "And, like any great relationship,"
    },
    {
      "start": 529,
      "text": "it just gets better and better as the years roll on."
    },
    {
      "start": 532,
      "text": "So keep looking. Don't settle."
    },
    {
      "start": 545,
      "text": "My third story is about death."
    },
    {
      "start": 549,
      "text": "When I was 17, I read a quote that went something like:"
    },
    {
      "start": 552,
      "text": "\"If you live each day as if it was your last,"
    },
    {
      "start": 555,
      "text": "someday you'll most certainly be right.\""
    },
    {
      "start": 560,
      "text": "It made an impression on me, and since then, for the past 33 years,"
    },
    {
      "start": 565,
      "text": "I have looked in the mirror every morning"
    },
    {
      "start": 567,
      "text": "and asked myself: \"If today were the last day of my life,"
    },
    {
      "start": 570,
      "text": "would I want to do what I am about to do today?\""
    },
    {
      "start": 574,
      "text": "And whenever the answer has been \"No\" for too many days in a row,"
    },
    {
      "start": 577,
      "text": "I know I need to change something."
    },
    {
      "start": 580,
      "text": "Remembering that I'll be dead soon is the most important"
    },
    {
      "start": 583,
      "text": "tool I've ever encountered to help me make the big choices in life."
    },
    {
      "start": 587,
      "text": "Because almost everything all external expectations, all pride,"
    },
    {
      "start": 592,
      "text": "all fear of embarrassment or failure -"
    },
    {
      "start": 594,
      "text": "these things just fall away in the face of death,"
    },
    {
      "start": 598,
      "text": "leaving only what is truly important."
    },
    {
      "start": 600,
      "text": "Remembering that you are going to die is the best"
    },
    {
      "start": 603,
      "text": "way I know to avoid the trap of thinking you have something to lose."
    },
    {
      "start": 608,
      "text": "You are already naked. There is no reason not to follow your heart."
    },
    {
      "start": 613,
      "text": "About a year ago I was diagnosed with cancer."
    },
    {
      "start": 616,
      "text": "I had a scan at 7:30 in the morning,"
    },
    {
      "start": 620,
      "text": "and it clearly showed a tumor on my pancreas."
    },
    {
      "start": 623,
      "text": "I didn't even know what a pancreas was."
    },
    {
      "start": 626,
      "text": "The doctors told me this was almost"
    },
    {
      "start": 628,
      "text": "certainly a type of cancer that is incurable,"
    },
    {
      "start": 630,
      "text": "and that I should expect to live no longer than three to six months."
    },
    {
      "start": 635,
      "text": "My doctor advised me to go home and get my affairs in order,"
    },
    {
      "start": 640,
      "text": "which is doctor's code for prepare to die."
    },
    {
      "start": 642,
      "text": "It means to try to tell your kids everything you thought"
    },
    {
      "start": 647,
      "text": "you'd have the next 10 years to tell them in just a few months."
    },
    {
      "start": 651,
      "text": "It means to make sure everything is buttoned"
    },
    {
      "start": 653,
      "text": "up so that it will be as easy as possible for your family."
    },
    {
      "start": 656,
      "text": "It means to say your goodbyes."
    },
    {
      "start": 661,
      "text": "I lived with that diagnosis all day."
    },
    {
      "start": 664,
      "text": "Later that evening I had a biopsy,"
    },
    {
      "start": 666,
      "text": "where they stuck an endoscope down my throat,"
    },
    {
      "start": 668,
      "text": "through my stomach and into my intestines,"
    },
    {
      "start": 671,
      "text": "put a needle into my pancreas and got a few cells from the tumor."
    },
    {
      "start": 674,
      "text": "I was sedated, but my wife, who was there,"
    },
    {
      "start": 678,
      "text": "told me that when they viewed the cells under a microscope"
    },
    {
      "start": 681,
      "text": "the doctors started crying because it turned out to be"
    },
    {
      "start": 684,
      "text": "a very rare form of pancreatic cancer that is curable with surgery."
    },
    {
      "start": 689,
      "text": "I had the surgery and thankfully I'm fine now."
    },
    {
      "start": 700,
      "text": "This was the closest I've been to facing death,"
    },
    {
      "start": 703,
      "text": "and I hope its the closest I get for a few more decades."
    },
    {
      "start": 706,
      "text": "Having lived through it,"
    },
    {
      "start": 708,
      "text": "I can now say this to you with a bit more certainty than when"
    },
    {
      "start": 711,
      "text": "death was a useful but purely intellectual concept:"
    },
    {
      "start": 715,
      "text": "No one wants to die."
    },
    {
      "start": 718,
      "text": "Even people who want to go to heaven don't want to die to get there."
    },
    {
      "start": 722,
      "text": "And yet death is the destination we all share."
    },
    {
      "start": 726,
      "text": "No one has ever escaped it. And that is as it should be,"
    },
    {
      "start": 730,
      "text": "because Death is very likely the single best invention of Life."
    },
    {
      "start": 735,
      "text": "It is Life's change agent."
    },
    {
      "start": 736,
      "text": "It clears out the old to make way for the new."
    },
    {
      "start": 739,
      "text": "Right now the new is you, but someday not too long from now,"
    },
    {
      "start": 744,
      "text": "you will gradually become the old and be cleared away."
    },
    {
      "start": 748,
      "text": "Sorry to be so dramatic, but it is quite true."
    },
    {
      "start": 752,
      "text": "Your time is limited, so don't waste it living someone else's life."
    },
    {
      "start": 758,
      "text": "Don't be trapped by dogma which is living"
    },
    {
      "start": 760,
      "text": "with the results of other people's thinking."
    },
    {
      "start": 762,
      "text": "Don't let the noise of others' opinions drown out your own inner"
    },
    {
      "start": 766,
      "text": "voice. And most important,"
    },
    {
      "start": 768,
      "text": "have the courage to follow your heart and intuition."
    },
    {
      "start": 771,
      "text": "They somehow already know what you truly want to become."
    },
    {
      "start": 775,
      "text": "Everything else is secondary."
    },
    {
      "start": 789,
      "text": "When I was young,"
    },
    {
      "start": 791,
      "text": "there was an amazing publication called The Whole Earth Catalog,"
    },
    {
      "start": 795,
      "text": "which was one of the bibles of my generation."
    },
    {
      "start": 798,
      "text": "It was created by a fellow named Stewart Brand not far from here"
    },
    {
      "start": 801,
      "text": "in Menlo Park, and he brought it to life with his poetic touch."
    },
    {
      "start": 805,
      "text": "This was in the late 1960's,"
    },
    {
      "start": 807,
      "text": "before personal computers and desktop publishing,"
    },
    {
      "start": 810,
      "text": "so it was all made with typewriters, scissors, and polaroid cameras."
    },
    {
      "start": 814,
      "text": "It was sort of like Google in paperback form,"
    },
    {
      "start": 816,
      "text": "35 years before Google came along: it was idealistic,"
    },
    {
      "start": 821,
      "text": "overflowing with neat tools, and great notions."
    },
    {
      "start": 825,
      "text": "Stewart and his team put out several"
    },
    {
      "start": 827,
      "text": "issues of The Whole Earth Catalog,"
    },
    {
      "start": 828,
      "text": "and then when it had run its course, they put out a final issue."
    },
    {
      "start": 833,
      "text": "It was the mid-1970s, and I was your age."
    },
    {
      "start": 838,
      "text": "On the back cover of their final issue"
    },
    {
      "start": 840,
      "text": "was a photograph of an early morning country road,"
    },
    {
      "start": 844,
      "text": "the kind you might find yourself"
    },
    {
      "start": 845,
      "text": "hitchhiking on if you were so adventurous."
    },
    {
      "start": 848,
      "text": "Beneath it were the words: \"Stay Hungry. Stay Foolish.\""
    },
    {
      "start": 853,
      "text": "It was their farewell message as they signed off. Stay Hungry."
    },
    {
      "start": 858,
      "text": "Stay Foolish. And I have always wished that for myself."
    },
    {
      "start": 863,
      "text": "And now, as you graduate to begin anew, I wish that for you."
    },
    {
      "start": 868,
      "text": "Stay Hungry. Stay Foolish."
    },
    {
      "start": 871,
      "text": "Thank you all very much."
    },
    {
      "start": 897,
      "text": "The preceding program is copyrighted by Stanford University."
    },
    {
      "start": 901,
      "text": "Please visit us at stanford.edu"
    }
  ]
}